KevinWangJian/SPC5775B_MCAL_Demo/src/MCAL/Module/Mcu/Inc/Reg_eSys_PLLDIG.h
/**
*   @file    Reg_eSys_PLLDIG.h
*   @version 1.0.1
*
*   @brief   AUTOSAR Mcu - Macros for memory access.
*   @details Macros/Defines used for registry and memory read/write.
*
*   @addtogroup MCU
*   @{
*/
/*==================================================================================================
*   Project              : AUTOSAR 4.0 MCAL
*   Platform             : PA
*   Peripheral           : MC
*   Dependencies         : none
*
*   Autosar Version      : 4.0.3
*   Autosar Revision     : ASR_REL_4_0_REV_0003
*   Autosar Conf.Variant :
*   SW Version           : 1.0.1
*   Build Version        : MPC5777C_MCAL_1_0_1_RTM_HF5_ASR_REL_4_0_REV_0003_20190514
*
*   (c) Copyright 2006-2016 Freescale Semiconductor, Inc. 
*       Copyright 2017 NXP
*   All Rights Reserved.
==================================================================================================*/
/*==================================================================================================
==================================================================================================*/

#ifndef REG_ESYS_PLLDIG_H
#define REG_ESYS_PLLDIG_H


#ifdef __cplusplus
extern "C"{
#endif

/**
* @page misra_violations MISRA-C:2004 violations
*
* @section Reg_eSys_PLLDIG_h_REF_1
* Violates MISRA 2004 Advisory Rule 19.7, Function-like macro defined
* This violation is due to function like macros defined for register operations.
* Function like macros are used to reduce code complexity.
*
* @section [global]
* Violates MISRA 2004 Required Rule 5.1, Identifiers (internal and external) shall not rely
* on the significance of more than 31 characters. The used compilers use more than 31 chars for
* identifiers.
*
*/

/*==================================================================================================
*                                        INCLUDE FILES
* 1) system and project includes
* 2) needed interfaces from external units
* 3) internal and external interfaces from this unit
==================================================================================================*/
#include "Reg_eSys.h"
#include "Mcu_PLLDIG_IPVersion.h"
/*==================================================================================================
*                              SOURCE FILE VERSION INFORMATION
==================================================================================================*/
#define REG_ESYS_PLLDIG_VENDOR_ID                       43
#define REG_ESYS_PLLDIG_AR_RELEASE_MAJOR_VERSION        4
#define REG_ESYS_PLLDIG_AR_RELEASE_MINOR_VERSION        0
#define REG_ESYS_PLLDIG_AR_RELEASE_REVISION_VERSION     3
#define REG_ESYS_PLLDIG_SW_MAJOR_VERSION                1
#define REG_ESYS_PLLDIG_SW_MINOR_VERSION                0
#define REG_ESYS_PLLDIG_SW_PATCH_VERSION                1


/*==================================================================================================
*                                     FILE VERSION CHECKS
==================================================================================================*/
/* Check if current file and Reg_eSys header file are of the same version */
#ifndef DISABLE_MCAL_INTERMODULE_ASR_CHECK
    #if ((REG_ESYS_PLLDIG_AR_RELEASE_MAJOR_VERSION != REG_ESYS_AR_RELEASE_MAJOR_VERSION) || \
         (REG_ESYS_PLLDIG_AR_RELEASE_MINOR_VERSION != REG_ESYS_AR_RELEASE_MINOR_VERSION) \
        )
        #error "AutoSar Version Numbers of Reg_eSys_PLLDIG.h and Reg_eSys.h are different"
    #endif
#endif

/* Check if source file and Mcu_PLLDIG_IPVersion header file are from the same vendor */
#if (REG_ESYS_PLLDIG_VENDOR_ID != MCU_PLLDIG_IPVERSION_VENDOR_ID)
    #error "Reg_eSys_PLLDIG.h and Mcu_PLLDIG_IPVersion.h have different vendor ids"
#endif
/* Check if source file and Mcu_PLLDIG_IPVersion header file are of the same Autosar version */
#if ((REG_ESYS_PLLDIG_AR_RELEASE_MAJOR_VERSION != \
      MCU_PLLDIG_IPVERSION_AR_RELEASE_MAJOR_VERSION \
     ) || \
     (REG_ESYS_PLLDIG_AR_RELEASE_MINOR_VERSION != \
      MCU_PLLDIG_IPVERSION_AR_RELEASE_MINOR_VERSION \
     ) || \
     (REG_ESYS_PLLDIG_AR_RELEASE_REVISION_VERSION != \
      MCU_PLLDIG_IPVERSION_AR_RELEASE_REVISION_VERSION \
     ) \
    )
    #error "AutoSar Version Numbers of Reg_eSys_PLLDIG.h and Mcu_PLLDIG_IPVersion.h are different"
#endif
/* Check if source file and Mcu_PLLDIG_IPVersion header file are of the same Software version */
#if ((REG_ESYS_PLLDIG_SW_MAJOR_VERSION != MCU_PLLDIG_IPVERSION_SW_MAJOR_VERSION) || \
     (REG_ESYS_PLLDIG_SW_MINOR_VERSION != MCU_PLLDIG_IPVERSION_SW_MINOR_VERSION) || \
     (REG_ESYS_PLLDIG_SW_PATCH_VERSION != MCU_PLLDIG_IPVERSION_SW_PATCH_VERSION) \
    )
    #error "Software Version Numbers of Reg_eSys_PLLDIG.h and Mcu_PLLDIG_IPVersion.h are different"
#endif

/*==================================================================================================
*                                          CONSTANTS
==================================================================================================*/

/*==================================================================================================
*                                      DEFINES AND MACROS
==================================================================================================*/

#if ((IPV_PLLDIG == IPV_PLLDIG_02_00_04_00) || (IPV_PLLDIG == IPV_PLLDIG_02_00_04_01) || \
     (IPV_PLLDIG == IPV_PLLDIG_02_00_04_13) || (IPV_PLLDIG == IPV_PLLDIG_01_08_61_00) \
    )
    /* register definitions */
    /* PLLDIG PLL0 Control Register */
    #define PLLDIG_PLL0CR_ADDR32                ((uint32)(PLLDIG_BASEADDR + (uint32)0x00000000U))
    /* PLLDIG PLL0 Status Register */
    #define PLLDIG_PLL0SR_ADDR32                ((uint32)(PLLDIG_BASEADDR + (uint32)0x00000004U))
    /* PLLDIG PLL0 Divider Register */
    #define PLLDIG_PLL0DV_ADDR32                ((uint32)(PLLDIG_BASEADDR + (uint32)0x00000008U))
    /* PLLDIG PLL1 Control Register */
    #define PLLDIG_PLL1CR_ADDR32                ((uint32)(PLLDIG_BASEADDR + (uint32)0x00000020U))
    /* PLLDIG PLL1 Status Register */
    #define PLLDIG_PLL1SR_ADDR32                ((uint32)(PLLDIG_BASEADDR + (uint32)0x00000024U))
    /* PLLDIG PLL1 Divider Register */
    #define PLLDIG_PLL1DV_ADDR32                ((uint32)(PLLDIG_BASEADDR + (uint32)0x00000028U))
    /* PLLDIG PLL1 Frequency Modulation Register */
    #define PLLDIG_PLL1FM_ADDR32                ((uint32)(PLLDIG_BASEADDR + (uint32)0x0000002CU))
    /* PLLDIG PLL1 Fractional Divide Register */
    #define PLLDIG_PLL1FD_ADDR32                ((uint32)(PLLDIG_BASEADDR + (uint32)0x00000030U))

#elif (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23)
    /* pll 0 */
    #define PLLDIG_PLL0CAL3_ADDR32              ((uint32)(PLLDIG0_BASEADDR + (uint32)0x00000018U))
    #define PLLDIG_PLL0CR_ADDR32                ((uint32)(PLLDIG0_BASEADDR + (uint32)0x00000020U))
    #define PLLDIG_PLL0SR_ADDR32                ((uint32)(PLLDIG0_BASEADDR + (uint32)0x00000024U))
    #define PLLDIG_PLL0DV_ADDR32                ((uint32)(PLLDIG0_BASEADDR + (uint32)0x00000028U))
    #define PLLDIG_PLL0FM_ADDR32                ((uint32)(PLLDIG0_BASEADDR + (uint32)0x0000002CU))
    #define PLLDIG_PLL0FD_ADDR32                ((uint32)(PLLDIG0_BASEADDR + (uint32)0x00000030U))

    /* pll 1 */
    #define PLLDIG_PLL1CAL3_ADDR32              ((uint32)(PLLDIG1_BASEADDR + (uint32)0x00000018U))
    #define PLLDIG_PLL1CR_ADDR32                ((uint32)(PLLDIG1_BASEADDR + (uint32)0x00000020U))
    #define PLLDIG_PLL1SR_ADDR32                ((uint32)(PLLDIG1_BASEADDR + (uint32)0x00000024U))
    #define PLLDIG_PLL1DV_ADDR32                ((uint32)(PLLDIG1_BASEADDR + (uint32)0x00000028U))
    #define PLLDIG_PLL1FM_ADDR32                ((uint32)(PLLDIG1_BASEADDR + (uint32)0x0000002CU))
    #define PLLDIG_PLL1FD_ADDR32                ((uint32)(PLLDIG1_BASEADDR + (uint32)0x00000030U))

