KevinWangJian/SPC5775B_MCAL_Demo/src/MCAL/Module/Mcu/Inc/Reg_eSys_PLLDIG.h
    /* pll 2 */
    #define PLLDIG_PLL2CAL3_ADDR32              ((uint32)(PLLDIG2_BASEADDR + (uint32)0x00000018U))
    #define PLLDIG_PLL2CR_ADDR32                ((uint32)(PLLDIG2_BASEADDR + (uint32)0x00000020U))
    #define PLLDIG_PLL2SR_ADDR32                ((uint32)(PLLDIG2_BASEADDR + (uint32)0x00000024U))
    #define PLLDIG_PLL2DV_ADDR32                ((uint32)(PLLDIG2_BASEADDR + (uint32)0x00000028U))
    #define PLLDIG_PLL2FM_ADDR32                ((uint32)(PLLDIG2_BASEADDR + (uint32)0x0000002CU))
    #define PLLDIG_PLL2FD_ADDR32                ((uint32)(PLLDIG2_BASEADDR + (uint32)0x00000030U))

    /* pll 3 */
    #define PLLDIG_PLL3CAL3_ADDR32              ((uint32)(PLLDIG3_BASEADDR + (uint32)0x00000018U))
    #define PLLDIG_PLL3CR_ADDR32                ((uint32)(PLLDIG3_BASEADDR + (uint32)0x00000020U))
    #define PLLDIG_PLL3SR_ADDR32                ((uint32)(PLLDIG3_BASEADDR + (uint32)0x00000024U))
    #define PLLDIG_PLL3DV_ADDR32                ((uint32)(PLLDIG3_BASEADDR + (uint32)0x00000028U))
    #define PLLDIG_PLL3FM_ADDR32                ((uint32)(PLLDIG3_BASEADDR + (uint32)0x0000002CU))
    #define PLLDIG_PLL3FD_ADDR32                ((uint32)(PLLDIG3_BASEADDR + (uint32)0x00000030U))
#endif

#if (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23)
    #define PLLDIG_PLL0CAL1_ADDR32              ((uint32)(PLLDIG0_BASEADDR + (uint32)0x00000038U))
#endif

#if (IPV_PLLDIG == IPV_PLLDIG_02_00_04_29)
    /* pll 0 */
    #define PLLDIG_PLL0CR_ADDR32                ((uint32)(PLLDIG0_BASEADDR + (uint32)0x00000020U))
    #define PLLDIG_PLL0SR_ADDR32                ((uint32)(PLLDIG0_BASEADDR + (uint32)0x00000024U))
    #define PLLDIG_PLL0DV_ADDR32                ((uint32)(PLLDIG0_BASEADDR + (uint32)0x00000028U))
    #define PLLDIG_PLL0FM_ADDR32                ((uint32)(PLLDIG0_BASEADDR + (uint32)0x0000002CU))
    #define PLLDIG_PLL0FD_ADDR32                ((uint32)(PLLDIG0_BASEADDR + (uint32)0x00000030U))
    
    /* pll 1 */
    #define PLLDIG_PLL1CR_ADDR32                ((uint32)(PLLDIG1_BASEADDR + (uint32)0x00000020U))
    #define PLLDIG_PLL1SR_ADDR32                ((uint32)(PLLDIG1_BASEADDR + (uint32)0x00000024U))
    #define PLLDIG_PLL1DV_ADDR32                ((uint32)(PLLDIG1_BASEADDR + (uint32)0x00000028U))
    #define PLLDIG_PLL1FD_ADDR32                ((uint32)(PLLDIG1_BASEADDR + (uint32)0x00000030U))

    /* pll 2 */
    #define PLLDIG_PLL2CR_ADDR32                ((uint32)(PLLDIG2_BASEADDR + (uint32)0x00000020U))
    #define PLLDIG_PLL2SR_ADDR32                ((uint32)(PLLDIG2_BASEADDR + (uint32)0x00000024U))
    #define PLLDIG_PLL2DV_ADDR32                ((uint32)(PLLDIG2_BASEADDR + (uint32)0x00000028U))
    #define PLLDIG_PLL2FD_ADDR32                ((uint32)(PLLDIG2_BASEADDR + (uint32)0x00000030U))

    /* pll 3 */
    #define PLLDIG_PLL3CR_ADDR32                ((uint32)(PLLDIG3_BASEADDR + (uint32)0x00000020U))
    #define PLLDIG_PLL3SR_ADDR32                ((uint32)(PLLDIG3_BASEADDR + (uint32)0x00000024U))
    #define PLLDIG_PLL3DV_ADDR32                ((uint32)(PLLDIG3_BASEADDR + (uint32)0x00000028U))
    #define PLLDIG_PLL3FD_ADDR32                ((uint32)(PLLDIG3_BASEADDR + (uint32)0x00000030U))
    
    /* pll 4 */
    #define PLLDIG_PLL4CR_ADDR32                ((uint32)(PLLDIG4_BASEADDR + (uint32)0x00000020U))
    #define PLLDIG_PLL4SR_ADDR32                ((uint32)(PLLDIG4_BASEADDR + (uint32)0x00000024U))
    #define PLLDIG_PLL4DV_ADDR32                ((uint32)(PLLDIG4_BASEADDR + (uint32)0x00000028U))
    #define PLLDIG_PLL4FD_ADDR32                ((uint32)(PLLDIG4_BASEADDR + (uint32)0x00000030U))
#endif


/**************************************************************/
/*                 PLLDIG_PLL0CAL3                            */
/**************************************************************/
#define PLLDIG_PLL0CAL3_RWBITS_MASK32           ((uint32)0x3FFFC000U)
#define PLLDIG_PLL0CAL3_RESBITS_MASK32          ((uint32)0x00000000U)

#define PLLDIG_PLL0CAL3_MDFEN_MASK32            ((uint32)0x3FFFC000U)
#define PLLDIG_PLL0CAL3_MDFEN_SHIFT32           ((uint32)14U)

/**************************************************************/
/*                 PLLDIG_PLLCR                              */
/**************************************************************/
#define PLLDIG_PLLxCR_CLKCFG_MASK32             ((uint32)0x00000300U)

/**************************************************************/
/*                 PLLDIG_PLL0CR                              */
/**************************************************************/
#if (IPV_PLLDIG == IPV_PLLDIG_02_00_04_00)
    #define PLLDIG_PLL0CR_RWBITS_MASK32         ((uint32)0x0000000AU)
#elif (IPV_PLLDIG == IPV_PLLDIG_02_00_04_01)
    #define PLLDIG_PLL0CR_RWBITS_MASK32         ((uint32)0x00000008U)
#elif ((IPV_PLLDIG == IPV_PLLDIG_02_00_04_23) || (IPV_PLLDIG == IPV_PLLDIG_02_00_04_13))
    #define PLLDIG_PLL0CR_RWBITS_MASK32         ((uint32)0x0000008CU)
#elif (IPV_PLLDIG == IPV_PLLDIG_01_08_61_00)
    #define PLLDIG_PLL0CR_RWBITS_MASK32         ((uint32)0x00000308U)
#elif (IPV_PLLDIG == IPV_PLLDIG_02_00_04_29)
    #define PLLDIG_PLL0CR_RWBITS_MASK32         ((uint32)0x00000000U)
#endif

#define PLLDIG_PLL0CR_RESBITS_MASK32            ((uint32)0x00000000U)

#if ((IPV_PLLDIG == IPV_PLLDIG_02_00_04_13) || (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23) \
    )
    #define PLLDIG_PLL0CR_EXPDIE_MASK32         ((uint32)0x00000080U)
#endif

#define PLLDIG_PLL0CR_LOLIE_MASK32              ((uint32)0x00000008U)

#if ((IPV_PLLDIG == IPV_PLLDIG_02_00_04_23) || (IPV_PLLDIG == IPV_PLLDIG_02_00_04_13))
    #define PLLDIG_PLL0CR_LOLRE_MASK32          ((uint32)0x00000004U)
#endif

#if (IPV_PLLDIG == IPV_PLLDIG_02_00_04_00)
    #define PLLDIG_PLL0CR_LOCIE_MASK32          ((uint32)0x00000002U)
#endif

/* Clock Configuration status */
#define PLLDIG_PLL0CR_CLKCFG_MASK32             (PLLDIG_PLLxCR_CLKCFG_MASK32)
/* PLL off */
#define PLLDIG_PLL0CR_CLKCFG_BO_U32             ((uint32)0x00000000U)
/* Normal mode with PLL running */
#define PLLDIG_PLL0CR_CLKCFG_NR_U32             (PLLDIG_PLL0CR_CLKCFG_MASK32)

/**************************************************************/
/*                 PLLDIG_PLL0SR                              */
/**************************************************************/
#if ((IPV_PLLDIG == IPV_PLLDIG_02_00_04_00) || (IPV_PLLDIG == IPV_PLLDIG_02_00_04_01) || \
     (IPV_PLLDIG == IPV_PLLDIG_01_08_61_00) || (IPV_PLLDIG == IPV_PLLDIG_02_00_04_29) \
    )
    #define PLLDIG_PLL0SR_RWBITS_MASK32         ((uint32)0x00000008U)
#elif ((IPV_PLLDIG == IPV_PLLDIG_02_00_04_13) || (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23) \
      )
    #define PLLDIG_PLL0SR_RWBITS_MASK32         ((uint32)0x00000088U)
#endif

#define PLLDIG_PLL0SR_RESBITS_MASK32            ((uint32)0x00000000U)

#if ((IPV_PLLDIG == IPV_PLLDIG_02_00_04_13) || (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23) \
    )
    #define PLLDIG_PLL0SR_EXTPDF_MASK32         ((uint32)0x00000080U)
#endif

#define PLLDIG_PLL0SR_LOLF_MASK32               ((uint32)0x00000008U)
#define PLLDIG_PLL0SR_LOCK_MASK32               ((uint32)0x00000004U)

/**************************************************************/
/*                 PLLDIG_PLL0DV                              */
/**************************************************************/
#if ((IPV_PLLDIG == IPV_PLLDIG_02_00_04_00) || (IPV_PLLDIG == IPV_PLLDIG_02_00_04_01) || \
     (IPV_PLLDIG == IPV_PLLDIG_02_00_04_13) || (IPV_PLLDIG == IPV_PLLDIG_01_08_61_00) \
    )

    #define PLLDIG_PLL0DV_RWBITS_MASK32             ((uint32)0x783F707FU)
    #define PLLDIG_PLL0DV_RESBITS_MASK32            ((uint32)0x00000000U)

