KevinWangJian/SPC5775B_MCAL_Demo/src/MCAL/Module/Mcu/Inc/Reg_eSys_PLLDIG.h
#define PLLDIG_PLL1FD_SMDEN_MASK32              ((uint32)0x40000000U)

#if (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23)
    #define PLLDIG_PLL1FD_SDM2_MASK32               ((uint32)0x20000000U)
    #define PLLDIG_PLL1FD_SDM3_MASK32               ((uint32)0x10000000U)
#endif

#define PLLDIG_PLL1FD_DTHDIS_MASK32                 ((uint32)0x00030000U)
#define PLLDIG_PLL1FD_DTHDIS_SHIFT32                ((uint32)16U)

#define PLLDIG_PLL1FD_DTHDIS1_MASK32                 ((uint32)0x00020000U)
#define PLLDIG_PLL1FD_DTHDIS1_SHIFT32                ((uint32)17U)

#define PLLDIG_PLL1FD_DTHDIS0_MASK32                 ((uint32)0x00010000U)
#define PLLDIG_PLL1FD_DTHDIS0_SHIFT32                ((uint32)16U)

#if ((IPV_PLLDIG == IPV_PLLDIG_02_00_04_00) || (IPV_PLLDIG == IPV_PLLDIG_02_00_04_01) ||\
     (IPV_PLLDIG == IPV_PLLDIG_02_00_04_13) || (IPV_PLLDIG == IPV_PLLDIG_01_08_61_00) \
    )
    #define PLLDIG_PLL1FD_FRCDIV_MASK32             ((uint32)0x00000FFFU)
#elif ((IPV_PLLDIG == IPV_PLLDIG_02_00_04_23) || (IPV_PLLDIG == IPV_PLLDIG_02_00_04_29))
    #define PLLDIG_PLL1FD_MFN_MASK32                ((uint32)0x00007FFFU)
    #define PLLDIG_PLL1FD_MFN_SHIFT32               ((uint32)0U)
#endif

#if (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23)
    #define PLLDIG_PLL1FD_DTHRCTL_MASK32                ((uint32)0x003C0000U)
    #define PLLDIG_PLL1FD_DTHRCTL_SHIFT32               ((uint32)18U)
#endif

/**************************************************************/
/*                 PLLDIG_PLL2CAL3                            */
/**************************************************************/
#define PLLDIG_PLL2CAL3_RWBITS_MASK32           ((uint32)0x3FFFC000U)
#define PLLDIG_PLL2CAL3_RESBITS_MASK32          ((uint32)0x00000000U)

#define PLLDIG_PLL2CAL3_MDFEN_MASK32            ((uint32)0x3FFFC000U)
#define PLLDIG_PLL2CAL3_MDFEN_SHIFT32           ((uint32)14U)

/**************************************************************/
/*                 PLLDIG_PLL2CR                              */
/**************************************************************/
#if (IPV_PLLDIG == IPV_PLLDIG_02_00_04_29)
    #define PLLDIG_PLL2CR_RWBITS_MASK32             ((uint32)0x00000008U)
#else
    #define PLLDIG_PLL2CR_RWBITS_MASK32             ((uint32)0x00000088U)
#endif

#define PLLDIG_PLL2CR_RESBITS_MASK32            ((uint32)0x00000000U)

#define PLLDIG_PLL2CR_EXPDIE_MASK32             ((uint32)0x00000080U)
#define PLLDIG_PLL2CR_LOLIE_MASK32              ((uint32)0x00000008U)
#define PLLDIG_PLL2CR_CLKCFG_MASK32             (PLLDIG_PLLxCR_CLKCFG_MASK32)

/* Clock Configuration status */
/* PLL off */
#define PLLDIG_PLL2CR_CLKCFG_BO_U32             ((uint32)0x00000000U)
/* Normal mode with PLL running */
#define PLLDIG_PLL2CR_CLKCFG_NR_U32             (PLLDIG_PLL2CR_CLKCFG_MASK32)

/**************************************************************/
/*                 PLLDIG_PLL2SR                              */
/**************************************************************/
#if (IPV_PLLDIG == IPV_PLLDIG_02_00_04_29)
    #define PLLDIG_PLL2SR_RWBITS_MASK32             ((uint32)0x00000008U)
#else
    #define PLLDIG_PLL2SR_RWBITS_MASK32             ((uint32)0x00000088U)
#endif

#define PLLDIG_PLL2SR_RESBITS_MASK32            ((uint32)0x00000000U)

#define PLLDIG_PLL2SR_EXTPDF_MASK32             ((uint32)0x00000080U)
#define PLLDIG_PLL2SR_LOLF_MASK32               ((uint32)0x00000008U)
#define PLLDIG_PLL2SR_LOCK_MASK32               ((uint32)0x00000004U)

/**************************************************************/
/*                 PLLDIG_PLL2DV                              */
/**************************************************************/
#define PLLDIG_PLL2DV_RWBITS_MASK32             ((uint32)0x7E3F70FFU)
#define PLLDIG_PLL2DV_RESBITS_MASK32            ((uint32)0x00000000U)

#define PLLDIG_PLL2DV_RFDPHI1_MASK32            ((uint32)0x7E000000U)
#define PLLDIG_PLL2DV_RFDPHI1_SHIFT32           ((uint32)25U)

#define PLLDIG_PLL2DV_RFDPHI_MASK32             ((uint32)0x003F0000U)
#define PLLDIG_PLL2DV_RFDPHI_SHIFT32            ((uint32)16U)

#define PLLDIG_PLL2DV_PREDIV_MASK32             ((uint32)0x00007000U)
#define PLLDIG_PLL2DV_PREDIV_SHIFT32            ((uint32)12U)

#if ((IPV_PLLDIG == IPV_PLLDIG_02_00_04_29) || (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23))
    #define PLLDIG_PLL2DV_MFD_MASK32                ((uint32)0x000000FFU)
#else
    #define PLLDIG_PLL2DV_MFD_MASK32                ((uint32)0x0000007FU)
#endif
/**************************************************************/
/*                 PLLDIG_PLL2FM                              */
/**************************************************************/
#if (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23)
    #define PLLDIG_PLL2FM_RWBITS_MASK32             ((uint32)0x43FF07FFU)
#elif (IPV_PLLDIG == IPV_PLLDIG_02_00_04_29)
    #define PLLDIG_PLL2FM_RWBITS_MASK32             ((uint32)0x00000000U)
#else
    #define PLLDIG_PLL2FM_RWBITS_MASK32             ((uint32)0x7FFF07FFU)
#endif

#define PLLDIG_PLL2FM_RESBITS_MASK32            ((uint32)0x00000000U)

#define PLLDIG_PLL2FM_SSCGBYP_MASK32            ((uint32)0x40000000U)
#define PLLDIG_PLL2FM_MODSEL_MASK32             ((uint32)0x20000000U)

#if (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23)
    #define PLLDIG_PLL2FM_MODPRD_MASK32             ((uint32)0x03FF0000U)
    #define PLLDIG_PLL2FM_STEPSIZE_MASK32           (PLLDIG_PLL2FM_MODPRD_MASK32)
#elif (IPV_PLLDIG == IPV_PLLDIG_02_00_04_29)
    #define PLLDIG_PLL2FM_MODPRD_MASK32             ((uint32)0x00000000U)
#else
    #define PLLDIG_PLL2FM_MODPRD_MASK32             ((uint32)0x1FFF0000U)
#endif

#define PLLDIG_PLL2FM_MODPRD_SHIFT32            ((uint32)16U)
#define PLLDIG_PLL2FM_STEPSIZE_SHIFT32          (PLLDIG_PLL2FM_MODPRD_SHIFT32)

#define PLLDIG_PLL2FM_INCSTP_MASK32             ((uint32)0x000007FFU)
#define PLLDIG_PLL2FM_STEPNO_MASK32             (PLLDIG_PLL2FM_INCSTP_MASK32)

#define PLLDIG_PLL2FM_INCSTP_SHIFT32            ((uint32)0U)
#define PLLDIG_PLL2FM_STEPNO_SHIFT32            (PLLDIG_PLL2FM_INCSTP_SHIFT32)
/**************************************************************/
/*                 PLLDIG_PLL2FD                              */
/**************************************************************/
#if (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23)
    #define PLLDIG_PLL2FD_RWBITS_MASK32             ((uint32)0x703F7FFFU)
#elif (IPV_PLLDIG == IPV_PLLDIG_02_00_04_29)
    #define PLLDIG_PLL2FD_RWBITS_MASK32             ((uint32)0x400F7FFFU) 
#else
    #define PLLDIG_PLL2FD_RWBITS_MASK32             ((uint32)0x70037FFFU)
#endif

