KevinWangJian/SPC5775B_MCAL_Demo/src/MCAL/Module/Mcu/Inc/Reg_eSys_PLLDIG.h
#define PLLDIG_PLL2FD_RESBITS_MASK32            ((uint32)0x00000000U)

#define PLLDIG_PLL2FD_SMDEN_MASK32              ((uint32)0x40000000U)
#define PLLDIG_PLL2FD_SDM2_MASK32               ((uint32)0x20000000U)
#define PLLDIG_PLL2FD_SDM3_MASK32               ((uint32)0x10000000U)

#define PLLDIG_PLL2FD_DTHDIS_MASK32             ((uint32)0x00030000U)
#define PLLDIG_PLL2FD_DTHDIS_SHIFT32            ((uint32)16U)

#define PLLDIG_PLL2FD_MFN_MASK32                ((uint32)0x00007FFFU)
#define PLLDIG_PLL2FD_MFN_SHIFT32               ((uint32)0U)

#if (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23)
    #define PLLDIG_PLL2FD_DTHRCTL_MASK32                ((uint32)0x003C0000U)
    #define PLLDIG_PLL2FD_DTHRCTL_SHIFT32               ((uint32)18U)
#endif

/**************************************************************/
/*                 PLLDIG_PLL3CAL3                            */
/**************************************************************/
#define PLLDIG_PLL3CAL3_RWBITS_MASK32           ((uint32)0x3FFFC000U)
#define PLLDIG_PLL3CAL3_RESBITS_MASK32          ((uint32)0x00000000U)

#define PLLDIG_PLL3CAL3_MDFEN_MASK32            ((uint32)0x3FFFC000U)
#define PLLDIG_PLL3CAL3_MDFEN_SHIFT32           ((uint32)14U)

/**************************************************************/
/*                 PLLDIG_PLL3CR                              */
/**************************************************************/
#if (IPV_PLLDIG == IPV_PLLDIG_02_00_04_29)
    #define PLLDIG_PLL3CR_RWBITS_MASK32             ((uint32)0x00000008U)
#else
    #define PLLDIG_PLL3CR_RWBITS_MASK32             ((uint32)0x00000088U)
#endif

#define PLLDIG_PLL3CR_RESBITS_MASK32            ((uint32)0x00000000U)

#define PLLDIG_PLL3CR_EXPDIE_MASK32             ((uint32)0x00000080U)
#define PLLDIG_PLL3CR_LOLIE_MASK32              ((uint32)0x00000008U)

#define PLLDIG_PLL3CR_CLKCFG_MASK32             (PLLDIG_PLLxCR_CLKCFG_MASK32)

/* Clock Configuration status */
/* PLL off */
#define PLLDIG_PLL3CR_CLKCFG_BO_U32             ((uint32)0x00000000U)
/* Normal mode with PLL running */
#define PLLDIG_PLL3CR_CLKCFG_NR_U32             (PLLDIG_PLL3CR_CLKCFG_MASK32)

/**************************************************************/
/*                 PLLDIG_PLL3SR                              */
/**************************************************************/
#if (IPV_PLLDIG == IPV_PLLDIG_02_00_04_29)
    #define PLLDIG_PLL3SR_RWBITS_MASK32             ((uint32)0x00000008U)
#else
    #define PLLDIG_PLL3SR_RWBITS_MASK32             ((uint32)0x00000088U)
#endif

#define PLLDIG_PLL3SR_RESBITS_MASK32            ((uint32)0x00000000U)

#define PLLDIG_PLL3SR_EXTPDF_MASK32             ((uint32)0x00000080U)
#define PLLDIG_PLL3SR_LOLF_MASK32               ((uint32)0x00000008U)
#define PLLDIG_PLL3SR_LOCK_MASK32               ((uint32)0x00000004U)

/**************************************************************/
/*                 PLLDIG_PLL3DV                              */
/**************************************************************/
#define PLLDIG_PLL3DV_RWBITS_MASK32             ((uint32)0x7E3F70FFU)
#define PLLDIG_PLL3DV_RESBITS_MASK32            ((uint32)0x00000000U)

#define PLLDIG_PLL3DV_RFDPHI1_MASK32            ((uint32)0x7E000000U)
#define PLLDIG_PLL3DV_RFDPHI1_SHIFT32           ((uint32)25U)

#define PLLDIG_PLL3DV_RFDPHI_MASK32             ((uint32)0x003F0000U)
#define PLLDIG_PLL3DV_RFDPHI_SHIFT32            ((uint32)16U)

#define PLLDIG_PLL3DV_PREDIV_MASK32             ((uint32)0x00007000U)
#define PLLDIG_PLL3DV_PREDIV_SHIFT32            ((uint32)12U)

#if ((IPV_PLLDIG == IPV_PLLDIG_02_00_04_29) || (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23))
    #define PLLDIG_PLL3DV_MFD_MASK32                ((uint32)0x000000FFU)
#else
    #define PLLDIG_PLL3DV_MFD_MASK32                ((uint32)0x0000007FU)
#endif

/**************************************************************/
/*                 PLLDIG_PLL3FM                              */
/**************************************************************/
#if (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23)
    #define PLLDIG_PLL3FM_RWBITS_MASK32             ((uint32)0x43FF07FFU)
#elif (IPV_PLLDIG == IPV_PLLDIG_02_00_04_29)
    #define PLLDIG_PLL3FM_RWBITS_MASK32             ((uint32)0x00000000U)
#else
    #define PLLDIG_PLL3FM_RWBITS_MASK32             ((uint32)0x7FFF07FFU)
#endif

#define PLLDIG_PLL3FM_RESBITS_MASK32            ((uint32)0x00000000U)

#define PLLDIG_PLL3FM_SSCGBYP_MASK32            ((uint32)0x40000000U)
#define PLLDIG_PLL3FM_MODSEL_MASK32             ((uint32)0x20000000U)

#if (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23)
    #define PLLDIG_PLL3FM_MODPRD_MASK32             ((uint32)0x03FF0000U)
    #define PLLDIG_PLL3FM_STEPSIZE_MASK32           (PLLDIG_PLL3FM_MODPRD_MASK32)
#elif (IPV_PLLDIG == IPV_PLLDIG_02_00_04_29)
    #define PLLDIG_PLL3FM_MODPRD_MASK32             ((uint32)0x00000000U)
#else
    #define PLLDIG_PLL3FM_MODPRD_MASK32             ((uint32)0x1FFF0000U)
#endif

#define PLLDIG_PLL3FM_MODPRD_SHIFT32            ((uint32)16U)
#define PLLDIG_PLL3FM_STEPSIZE_SHIFT32          (PLLDIG_PLL3FM_MODPRD_SHIFT32)

#define PLLDIG_PLL3FM_INCSTP_MASK32             ((uint32)0x000007FFU)
#define PLLDIG_PLL3FM_STEPNO_MASK32             (PLLDIG_PLL3FM_INCSTP_MASK32)

#define PLLDIG_PLL3FM_INCSTP_SHIFT32            ((uint32)0U)
#define PLLDIG_PLL3FM_STEPNO_SHIFT32            (PLLDIG_PLL3FM_INCSTP_SHIFT32)

/**************************************************************/
/*                 PLLDIG_PLL3FD                              */
/**************************************************************/

#if (IPV_PLLDIG == IPV_PLLDIG_02_00_04_23)
    #define PLLDIG_PLL3FD_RWBITS_MASK32             ((uint32)0x703F7FFFU)
#elif (IPV_PLLDIG == IPV_PLLDIG_02_00_04_29)
    #define PLLDIG_PLL3FD_RWBITS_MASK32             ((uint32)0x40007FFFU)
#else
    #define PLLDIG_PLL3FD_RWBITS_MASK32             ((uint32)0x70037FFFU)
#endif

#define PLLDIG_PLL3FD_RESBITS_MASK32            ((uint32)0x00000000U)

#define PLLDIG_PLL3FD_SMDEN_MASK32              ((uint32)0x40000000U)
#define PLLDIG_PLL3FD_SDM2_MASK32               ((uint32)0x20000000U)
#define PLLDIG_PLL3FD_SDM3_MASK32               ((uint32)0x10000000U)

#define PLLDIG_PLL3FD_DTHDIS_MASK32             ((uint32)0x00030000U)
#define PLLDIG_PLL3FD_DTHDIS_SHIFT32            ((uint32)16U)

#define PLLDIG_PLL3FD_MFN_MASK32                ((uint32)0x00007FFFU)
#define PLLDIG_PLL3FD_MFN_SHIFT32               ((uint32)0U)

